Revit 2027 API
BuiltInFailures.StairRampFailures.LandingHeightUnderStairsBottom Property
 Cannot make landing because height of landing is equal or less than to bottom height of the stair.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId LandingHeightUnderStairsBottom { get; }
Public Shared ReadOnly Property LandingHeightUnderStairsBottom As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ LandingHeightUnderStairsBottom {
	FailureDefinitionId^ get ();
}
static member LandingHeightUnderStairsBottom : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace